charliexp/Synwit-Arm-2D/examples/SWM190/CSL/SWM190_StdPeriph_Driver/SWM190_spi.c
/****************************************************************************************************************************************** 
* 文件名称:	SWM190_spi.c
* 功能说明:	SWM190单片机的SPI功能驱动库
* 技术支持:	http://www.synwit.com.cn/e/tool/gbook/?bid=1
* 注意事项:
* 版本日期:	V1.0.0		2016年1月30日
* 升级记录:  
*
*
*******************************************************************************************************************************************
* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS WITH CODING INFORMATION 
* REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME. AS A RESULT, SYNWIT SHALL NOT BE HELD LIABLE 
* FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT 
* OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION CONTAINED HEREIN IN CONN-
* -ECTION WITH THEIR PRODUCTS.
*
* COPYRIGHT 2012 Synwit Technology
*******************************************************************************************************************************************/
#include "SWM190.h"
#include "SWM190_spi.h"


/****************************************************************************************************************************************** 
* 函数名称:	SPI_Init()
* 功能说明:	SPI同步串行接口初始化，包括帧长度设定、时序设定、速度设定、中断设定、FIFO触发设定
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
*			SPI_InitStructure * initStruct	包含SPI相关设定值的结构体
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_Init(SPI_TypeDef * SPIx, SPI_InitStructure * initStruct)
{
	uint32_t fast = 0, no_sync = 0;
	
	switch((uint32_t)SPIx)
	{
	case ((uint32_t)SPI0):
		SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_SPI0_Pos);
		break;

	case ((uint32_t)SPI1):
		SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_SPI1_Pos);
		break;
	}
	
	SPI_Close(SPIx);	//一些关键寄存器只能在SPI关闭时设置
	
	if(initStruct->clkDiv == SPI_CLKDIV_2)
	{
		fast = 1;
		no_sync = 1;
	}
	else if(initStruct->clkDiv == SPI_CLKDIV_4)
	{
		no_sync = 1;
	}
	
	SPIx->CTRL &= ~(SPI_CTRL_FFS_Msk | SPI_CTRL_CPHA_Msk | SPI_CTRL_CPOL_Msk | SPI_CTRL_SIZE_Msk | SPI_CTRL_MSTR_Msk | 
	                SPI_CTRL_CLKDIV_Msk | SPI_CTRL_SSN_H_Msk | SPI_CTRL_RFTHR_Msk | SPI_CTRL_TFTHR_Msk);
	SPIx->CTRL |= (initStruct->FrameFormat     << SPI_CTRL_FFS_Pos)    |
				  (initStruct->SampleEdge      << SPI_CTRL_CPHA_Pos)   |
				  (initStruct->IdleLevel       << SPI_CTRL_CPOL_Pos)   |
				  ((initStruct->WordSize-1)    << SPI_CTRL_SIZE_Pos)   |
				  (initStruct->Master          << SPI_CTRL_MSTR_Pos)   |
				  (fast                        << SPI_CTRL_FAST_Pos)   |
				  (no_sync                     << SPI_CTRL_NSYNC_Pos)  |
				  ((initStruct->clkDiv & 7)    << SPI_CTRL_CLKDIV_Pos) |
				  (0                           << SPI_CTRL_SSN_H_Pos)  |
				  ((initStruct->RXThreshold > 0 ? initStruct->RXThreshold-1 : 0) << SPI_CTRL_RFTHR_Pos)  |
				  (initStruct->TXThreshold     << SPI_CTRL_TFTHR_Pos)  |
				  (1                           << SPI_CTRL_RFCLR_Pos)  |
	              (1                           << SPI_CTRL_TFCLR_Pos);
	SPIx->CTRL &= ~(SPI_CTRL_RFCLR_Msk | SPI_CTRL_TFCLR_Msk);
	
	SPIx->IF = 0x37F;	//清除中断标志
	SPIx->IE = 0x000;
	SPIx->IE |= (initStruct->RXThresholdIEn << SPI_IE_RFTHR_Pos) |
				(initStruct->TXThresholdIEn << SPI_IE_TFTHR_Pos) |
	            (initStruct->TXCompleteIEn  << SPI_IE_FTC_Pos);
	
	switch((uint32_t)SPIx)
	{
	case ((uint32_t)SPI0):		
		if(initStruct->RXThresholdIEn | initStruct->TXThresholdIEn | initStruct->TXCompleteIEn)
		{
			NVIC_EnableIRQ(SPI0_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(SPI0_IRQn);
		}
		break;
	
	case ((uint32_t)SPI1):		
		if(initStruct->RXThresholdIEn | initStruct->TXThresholdIEn | initStruct->TXCompleteIEn)
		{
			NVIC_EnableIRQ(SPI1_BTIMR1_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(SPI1_BTIMR1_IRQn);
		}
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_Open()
* 功能说明:	SPI打开，允许收发
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_Open(SPI_TypeDef * SPIx)
{
	SPIx->CTRL |= (0x01 << SPI_CTRL_EN_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_Close()
* 功能说明:	SPI关闭，禁止收发
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_Close(SPI_TypeDef * SPIx)
{
	SPIx->CTRL &= ~SPI_CTRL_EN_Msk;
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_Read()
* 功能说明:	读取一个数据
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: uint32_t				读取到的数据
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t SPI_Read(SPI_TypeDef * SPIx)
{
	return SPIx->DATA;
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_Write()
* 功能说明:	写入一个数据
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
*			uint32_t				要写入的数据
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_Write(SPI_TypeDef * SPIx, uint32_t data)
{
	SPIx->DATA = data;
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_WriteWithWait()
* 功能说明:	写入一个数据并等待数据完全发送出去
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1、SPI1
*			uint32_t				要写入的数据
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_WriteWithWait(SPI_TypeDef * SPIx, uint32_t data)
{
	SPIx->STAT |= (1 << SPI_STAT_WTC_Pos);
	
