charliexp/Synwit-Arm-2D/examples/SWM190/CSL/SWM190_StdPeriph_Driver/SWM190_spi.c
	SPIx->DATA = data;
	
	while((SPIx->STAT & SPI_STAT_WTC_Msk) == 0);
}

/****************************************************************************************************************************************** 
* 函数名称: SPI_ReadWrite()
* 功能说明: 发送一个数据，并返回发送过程中接收到的
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
*			uint32_t data 			要发送的数据
* 输    出: uint32_t				接收到的数据
* 注意事项: 对于同一个SPI模块，此函数不应与SPI_Write()混着用，因为SPI_Write()不清除SPI_STAT_RFNE状态
******************************************************************************************************************************************/
uint32_t SPI_ReadWrite(SPI_TypeDef * SPIx, uint32_t data)
{
	SPIx->DATA = data;
	while(!(SPIx->STAT & SPI_STAT_RFNE_Msk));
	
	return SPIx->DATA;
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_IsRXEmpty()
* 功能说明:	接收FIFO是否空，如果不空则可以继续SPI_Read()
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: uint32_t				1 接收FIFO空    0 接收FIFO非空
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t SPI_IsRXEmpty(SPI_TypeDef * SPIx)
{
	return (SPIx->STAT & SPI_STAT_RFNE_Msk) ? 0 : 1;
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_IsTXFull()
* 功能说明:	发送FIFO是否满，如果不满则可以继续SPI_Write()
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: uint32_t				1 发送FIFO满    0 发送FIFO不满
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t SPI_IsTXFull(SPI_TypeDef * SPIx)
{
	return (SPIx->STAT & SPI_STAT_TFNF_Msk) ? 0 : 1;
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_IsTXEmpty()
* 功能说明:	发送FIFO是否空
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: uint32_t				1 发送FIFO空    0 发送FIFO非空
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t SPI_IsTXEmpty(SPI_TypeDef * SPIx)
{
	return (SPIx->STAT & SPI_STAT_TFE_Msk) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXHalfFullEn()
* 功能说明:	接收FIFO半满中断使能
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTRXHalfFullEn(SPI_TypeDef * SPIx)
{
	SPIx->IE |= (0x01 << SPI_IE_RFHF_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXHalfFullDis()
* 功能说明:	接收FIFO半满中断禁止
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTRXHalfFullDis(SPI_TypeDef * SPIx)
{
	SPIx->IE &= ~(0x01 << SPI_IE_RFHF_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXHalfFullClr()
* 功能说明:	接收FIFO半满中断标志清除
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTRXHalfFullClr(SPI_TypeDef * SPIx)
{
	SPIx->IF = (1 << SPI_IF_RFHF_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXHalfFullStat()
* 功能说明:	接收FIFO半满中断状态
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: uint32_t				1 接收FIFO达到半满    0 接收FIFO未达到半满
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t SPI_INTRXHalfFullStat(SPI_TypeDef * SPIx)
{
	return (SPIx->IF & SPI_IF_RFHF_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXFullEn()
* 功能说明:	接收FIFO满中断使能
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTRXFullEn(SPI_TypeDef * SPIx)
{
	SPIx->IE |= (0x01 << SPI_IE_RFF_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXFullDis()
* 功能说明:	接收FIFO满中断禁止
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTRXFullDis(SPI_TypeDef * SPIx)
{
	SPIx->IE &= ~(0x01 << SPI_IE_RFF_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXFullClr()
* 功能说明:	接收FIFO满中断标志清除
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTRXFullClr(SPI_TypeDef * SPIx)
{
	SPIx->IF = (1 << SPI_IF_RFF_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXFullStat()
* 功能说明:	接收FIFO满中断状态
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: uint32_t				1 接收FIFO满    0 接收FIFO未满
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t SPI_INTRXFullStat(SPI_TypeDef * SPIx)
{
	return (SPIx->IF & SPI_IF_RFF_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXOverflowEn()
* 功能说明:	接收FIFO溢出中断使能
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTRXOverflowEn(SPI_TypeDef * SPIx)
{
	SPIx->IE |= (0x01 << SPI_IE_RFOV_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXOverflowDis()
* 功能说明:	接收FIFO溢出中断禁止
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTRXOverflowDis(SPI_TypeDef * SPIx)
{
	SPIx->IE &= ~(0x01 << SPI_IE_RFOV_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXOverflowClr()
* 功能说明:	接收FIFO溢出中断标志清除
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTRXOverflowClr(SPI_TypeDef * SPIx)
{
	SPIx->IF = (0x01 << SPI_IF_RFOV_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXOverflowStat()
* 功能说明:	接收FIFO溢出中断状态
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: uint32_t				1 接收FIFO溢出    0 接收FIFO未溢出
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t SPI_INTRXOverflowStat(SPI_TypeDef * SPIx)
{
	return (SPIx->IF & SPI_IF_RFOV_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTTXEmptyEn()
* 功能说明:	发送FIFO空中断使能
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTTXEmptyEn(SPI_TypeDef * SPIx)
{
	SPIx->IE |= (0x01 << SPI_IE_TFE_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTTXEmptyDis()
* 功能说明:	发送FIFO空中断禁止
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTTXEmptyDis(SPI_TypeDef * SPIx)
{
	SPIx->IE &= ~(0x01 << SPI_IE_TFE_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTTXEmptyClr()
* 功能说明:	发送FIFO空中断标志清除
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTTXEmptyClr(SPI_TypeDef * SPIx)
{
	SPIx->IF = (1 << SPI_IF_TFE_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTTXEmptyStat()
* 功能说明:	发送FIFO空中断状态
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: uint32_t				1 发送FIFO空    0 发送FIFO非空
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t SPI_INTTXEmptyStat(SPI_TypeDef * SPIx)
{
	return (SPIx->IF & SPI_IF_TFE_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTTXCompleteEn()
* 功能说明:	发送FIFO空且发送移位寄存器空中断使能
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTTXCompleteEn(SPI_TypeDef * SPIx)
{
	SPIx->IE |= (0x01 << SPI_IE_FTC_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTTXCompleteDis()
* 功能说明:	发送FIFO空且发送移位寄存器空中断禁止
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTTXCompleteDis(SPI_TypeDef * SPIx)
{
	SPIx->IE &= ~(0x01 << SPI_IE_FTC_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTTXCompleteClr()
* 功能说明:	发送FIFO空且发送移位寄存器空中断状态清除
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTTXCompleteClr(SPI_TypeDef * SPIx)
{
	SPIx->IF = (1 << SPI_IF_FTC_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTTXCompleteStat()
* 功能说明:	发送FIFO空且发送移位寄存器空中断状态
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: uint32_t				1 发送FIFO空且发送移位寄存器空    0 发送FIFO或发送移位寄存器非空
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t SPI_INTTXCompleteStat(SPI_TypeDef * SPIx)
{
	return (SPIx->IF & SPI_IF_FTC_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXThresholdEn()
* 功能说明:	接收FIFO中数据个数≥CTRL.RXTHR中断使能
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTRXThresholdEn(SPI_TypeDef * SPIx)
{
	SPIx->IE |= (0x01 << SPI_IE_RFTHR_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXThresholdDis()
* 功能说明:	接收FIFO中数据个数≥CTRL.RXTHR中断禁止
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTRXThresholdDis(SPI_TypeDef * SPIx)
{
	SPIx->IE &= ~(0x01 << SPI_IE_RFTHR_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXThresholdClr()
* 功能说明:	接收FIFO中数据个数≥CTRL.RXTHR中断标志清除
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTRXThresholdClr(SPI_TypeDef * SPIx)
{
	SPIx->IF = (1 << SPI_IF_RFTHR_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTRXThresholdStat()
* 功能说明:	接收FIFO中数据个数≥CTRL.RXTHR中断状态
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: uint32_t				1 接收FIFO中数据个数≥CTRL.RXTHR    0 接收FIFO中数据个数不≥CTRL.RXTHR
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t SPI_INTRXThresholdStat(SPI_TypeDef * SPIx)
{
	return (SPIx->IF & SPI_IF_RFTHR_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTTXThresholdEn()
* 功能说明:	发送FIFO中数据个数≤CTRL.TXTHR中断使能
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTTXThresholdEn(SPI_TypeDef * SPIx)
{
	SPIx->IE |= (0x01 << SPI_IE_TFTHR_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTTXThresholdDis()
* 功能说明:发送FIFO中数据个数≤CTRL.TXTHR中断禁止
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTTXThresholdDis(SPI_TypeDef * SPIx)
{
	SPIx->IE &= ~(0x01 << SPI_IE_TFTHR_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTTXThresholdClr()
* 功能说明:	发送FIFO中数据个数≤CTRL.TXTHR中断标志清除
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void SPI_INTTXThresholdClr(SPI_TypeDef * SPIx)
{
	SPIx->IF = (1 << SPI_IF_TFTHR_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	SPI_INTTXThresholdStat()
* 功能说明:	发送FIFO中数据个数≤CTRL.TXTHR中断状态
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: uint32_t				1 发送FIFO中数据个数≤CTRL.TXTHR    0 发送FIFO中数据个数不≤CTRL.TXTHR
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t SPI_INTTXThresholdStat(SPI_TypeDef * SPIx)
{
	return (SPIx->IF & SPI_IF_TFTHR_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	I2S_Init()
* 功能说明:	I2S音频串行接口初始化，包括帧格式、数据长度、时钟频率、中断设定、FIFO触发设定
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
*			I2S_InitStructure * initStruct	包含I2S相关设定值的结构体
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void I2S_Init(SPI_TypeDef * SPIx, I2S_InitStructure * initStruct)
{
	switch((uint32_t)SPIx)
	{
	case ((uint32_t)SPI0):
		SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_SPI0_Pos);
		break;

	case ((uint32_t)SPI1):
		SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_SPI1_Pos);
		break;
	}
	
	I2S_Close(SPIx);	//一些关键寄存器只能在SPI关闭时设置
	
	SPIx->CTRL &= ~(SPI_CTRL_FFS_Msk | SPI_CTRL_RFTHR_Msk | SPI_CTRL_TFTHR_Msk);
	SPIx->CTRL |= (SPI_FORMAT_I2S     		   << SPI_CTRL_FFS_Pos)    |
				  ((initStruct->RXThreshold > 0 ? initStruct->RXThreshold-1 : 0) << SPI_CTRL_RFTHR_Pos)  |
				  (initStruct->TXThreshold     << SPI_CTRL_TFTHR_Pos)  |
				  (1                           << SPI_CTRL_RFCLR_Pos)  |
	              (1                           << SPI_CTRL_TFCLR_Pos);
	SPIx->CTRL &= ~(SPI_CTRL_RFCLR_Msk | SPI_CTRL_TFCLR_Msk);
	
	SPIx->I2SCR &= ~(SPI_I2SCR_MSTR_Msk | SPI_I2SCR_DIEN_Msk | SPI_I2SCR_DOEN_Msk | SPI_I2SCR_FFMT_Msk | SPI_I2SCR_DLEN_Msk | SPI_I2SCR_PCMSYNW_Msk);
	SPIx->I2SCR |= ((initStruct->Mode & 0x04 ? 1 : 0) << SPI_I2SCR_MSTR_Pos) |
				   ((initStruct->Mode & 0x02 ? 1 : 0) << SPI_I2SCR_DOEN_Pos) |
				   ((initStruct->Mode & 0x01 ? 1 : 0) << SPI_I2SCR_DIEN_Pos) |
				   ((initStruct->FrameFormat & 0x03)  << SPI_I2SCR_FFMT_Pos) |
				   (initStruct->DataLen               << SPI_I2SCR_DLEN_Pos) |
				   ((initStruct->FrameFormat & 0x04 ? 1 : 0) << SPI_I2SCR_PCMSYNW_Pos);
	
	SPIx->I2SPR &= ~SPI_I2SPR_SCLKDIV_Msk;
	SPIx->I2SPR |= (SystemCoreClock / initStruct->ClkFreq / 2 - 1) << SPI_I2SPR_SCLKDIV_Pos;
	
	SPIx->IF = 0x37F;	//清除中断标志
	SPIx->IE = 0x000;
	SPIx->IE |= (initStruct->RXThresholdIEn << SPI_IE_RFTHR_Pos) |
				(initStruct->TXThresholdIEn << SPI_IE_TFTHR_Pos) |
	            (initStruct->TXCompleteIEn  << SPI_IE_FTC_Pos);
	
	switch((uint32_t)SPIx)
	{
	case ((uint32_t)SPI0):		
		if(initStruct->RXThresholdIEn | initStruct->TXThresholdIEn | initStruct->TXCompleteIEn)
		{
			NVIC_EnableIRQ(SPI0_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(SPI0_IRQn);
		}
		break;
	
	case ((uint32_t)SPI1):		
		if(initStruct->RXThresholdIEn | initStruct->TXThresholdIEn | initStruct->TXCompleteIEn)
		{
			NVIC_EnableIRQ(SPI1_BTIMR1_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(SPI1_BTIMR1_IRQn);
		}
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	I2S_Open()
* 功能说明:	I2S打开，允许收发
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void I2S_Open(SPI_TypeDef * SPIx)
{
	SPIx->CTRL |= (0x01 << SPI_CTRL_EN_Pos);	//使能SPI才能使用TX Complete中断
	SPIx->I2SCR |= (0x01 << SPI_I2SCR_EN_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	I2S_Close()
* 功能说明:	I2S关闭，禁止收发
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void I2S_Close(SPI_TypeDef * SPIx)
{
	SPIx->CTRL &= ~SPI_CTRL_EN_Msk;
	SPIx->I2SCR &= ~SPI_I2SCR_EN_Msk;
}

/****************************************************************************************************************************************** 
* 函数名称:	I2S_MCLKConfig()
* 功能说明:	I2S MCLK时钟输出配置
* 输    入: SPI_TypeDef * SPIx		指定要被设置的SPI，有效值包括SPI0、SPI1
*			uint32_t output_enable	是否输出MCLK时钟
*			uint32_t mclk_freq		MCLK时钟频率
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void I2S_MCLKConfig(SPI_TypeDef * SPIx, uint32_t output_enable, uint32_t mclk_freq)
{
	if(output_enable)
	{
		SPIx->I2SPR &= ~SPI_I2SPR_MCLKDIV_Msk;
		SPIx->I2SPR |= (SystemCoreClock / mclk_freq / 2 - 1) << SPI_I2SPR_MCLKDIV_Pos;
		
		SPIx->I2SCR |= (1 << SPI_I2SCR_MCLKOE_Pos);
	}
	else
	{
		SPIx->I2SCR &= ~(1 << SPI_I2SCR_MCLKOE_Pos);
	}
}
